#+title: The cut-pair matrix
#+property: header-args:sage :session
#+options: toc:nil

* Root system setup
Fix a root system to work with.
#+begin_src sage
  R = RootSystem(CartanType(['E',8]))
  R.root_lattice().dynkin_diagram()
#+end_src

#+RESULTS:
:         O 2
:         |
:         |
: O---O---O---O---O---O---O
: 1   3   4   5   6   7   8   
: E8

Simple roots
#+begin_src sage :results silent
  alpha = R.root_lattice().simple_roots()
#+end_src

* Central charges and stability ordering

Helper functions to compute the central charge and argument of the central charge for any given root.
#+begin_src sage :cache yes :results silent
  def compute_central_charge(r):
      return vector(r) * central_charge

  def central_charge_argument(r):
      z = compute_central_charge(r)
      angle = arg(z[0] + i*z[1])
      return angle
#+end_src

Set the central charge and check if it is generic.
#+begin_src sage :cache yes
  def random_cc():
    a = randint(-50,50)
    b = randint(1,15)
    return vector([a,b])

  central_charge = matrix([random_cc() for _ in alpha.keys()])
  central_charge

  def central_charge_is_generic():
    args = [central_charge_argument(r) for r in R.root_lattice().positive_roots()]
    return len(set(args)) == len(args)
  central_charge_is_generic()
#+end_src

#+RESULTS[9d6a25dfad3d661c4e68a5cceb4b89db74f5b92c]:
: [-48   5]
: [ 41   4]
: [  1   7]
: [ 37  14]
: [-37  14]
: [-21  15]
: [-23   6]
: [-13   3]
: True

Remember the original simple and semistable objects.
#+begin_src sage
  original_simples = list(alpha)
  original_simples.sort(key = lambda r: central_charge_argument(r))
  original_semistables = list(R.root_lattice().positive_roots())
  original_semistables.sort(key = lambda r: central_charge_argument(r))
#+end_src

#+RESULTS:

Construct a generator that gives successive tilts of the original stability condition.
#+begin_src sage :results silent
  def tilted_stability_condition_generator():
      simples = original_simples.copy()
      semistables = original_semistables.copy()

      for i in range(0,len(original_semistables)):
          if i == 0:
              yield semistables, simples
          else:
              last_semistable = semistables.pop()
              semistables.insert(0, -1 * last_semistable)

              assert last_semistable in simples
              simples = [x.reflection(last_semistable) for x in simples]
              simples.sort(key = lambda r: central_charge_argument(r))

              yield semistables, simples
#+end_src

Suppose we fix a system of simple roots, and specify a number for each simple root.
We think of this assignment as a functional on the roots.
By linearity, we can compute the value of the functional on any root.
In particular, for the original list of semistable objects, either the class of the root is positive with respect to the fixed system of simple roots, or the class is negative with respect to the fixed system of simple roots.

The following code computes this.
Note however that since we only care about objects up to triangulated shift, we always take the absolute value of the value of the functional.

We specify the functional as a list of numbers of length equal to the number of simple roots.
The output is a list of length equal to the number of positive roots.

Each entry in the list is the absolute value of the value of the functional on the corresponding root in the ~original_semistables~ list.
#+begin_src sage
  def compute_positive_functional(simple_system, functional):
      assert len(simple_system) == len(functional)
      simple_system_coefficients_inverse = matrix([vector(r) for r in simple_system]).inverse()

      answers = []
      for s in original_semistables:
          s_coefficients = matrix(vector(s))
          s_coefficients_new = s_coefficients * simple_system_coefficients_inverse
          value = s_coefficients_new[0].dot_product(functional)
          answers.append(abs(value))
      return answers

  cut_functional = matrix.identity(len(original_simples)).rows()[0]
  tilt_gen = tilted_stability_condition_generator()
  def compute_cut_pair_matrix():
      cut_pairs = []
      for x in tilt_gen:
          cut_pairs.append(compute_positive_functional(x[1], cut_functional))
      return matrix(cut_pairs)

  cut_pair_matrix = compute_cut_pair_matrix()
  #cut_pair_matrix.rank()
  #cut_pair_matrix.determinant()
#+end_src

#+RESULTS:
: 120
: -5192296858534827628530496329220096

#+begin_src sage
  #print(cut_pair_matrix.str())
#+end_src

#+RESULTS:
#+begin_example
[1 1 1 0 0 1 1 1 1 1 1 1 1 2 1 1 1 1 2 0 1 1 2 1 2 2 2 0 0 1 2 2 3 1 2 1 3 1 1 1 2 1 2 1 2 2 3 1 2 1 2 3 1 3 2 1 2 3 1 2 1 1 2 1 1 1 3 1 0 3 0 2 2 2 2 2 2 1 2 0 1 1 1 2 1 1 1 1 1 2 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0]
[0 0 1 0 1 1 0 1 0 1 0 1 1 1 0 1 1 1 1 1 1 0 1 1 1 2 1 1 0 1 2 1 2 1 1 0 2 1 0 1 2 0 1 1 1 1 2 1 2 1 1 2 1 1 2 1 1 2 1 1 1 0 1 0 0 1 2 1 0 2 1 2 1 2 1 1 1 0 1 0 1 1 1 1 1 0 1 1 1 1 0 0 1 1 0 1 1 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1]
[0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 1 1 1 0 0 1 0 0 1 1 0 1 1 1 0 1 1 1 1 0 1 1 1 0 1 1 1 1 0 1 1 1 1 1 0 0 0 0 0 0 0 0 2 0 0 1 0 1 1 1 1 1 1 0 1 0 1 1 1 1 1 1 0 0 1 1 0 1 1 0 0 1 1 1 1 1 1 0 0 0 0 0 0 1 0 0 1 1 0 0 0 1 0 0 1 0]
[0 0 0 0 0 0 0 0 0 1 0 0 1 1 1 1 0 1 1 0 1 1 0 1 2 2 2 0 0 1 1 1 2 1 1 1 2 1 0 1 1 1 1 0 1 2 2 0 2 2 2 2 0 2 2 2 2 3 1 1 0 0 1 1 0 1 3 1 0 2 1 2 1 2 1 2 2 1 2 1 2 1 1 2 1 1 1 0 2 2 0 2 1 1 1 2 1 1 1 1 1 0 0 0 0 1 1 1 0 1 1 1 0 0 0 0 0 1 1 0]
[0 1 1 1 1 2 1 1 0 2 1 1 2 2 1 1 2 2 2 0 1 1 2 2 2 3 3 1 1 2 3 3 4 1 2 1 4 2 0 1 3 1 3 2 2 2 4 2 4 2 2 3 1 3 3 2 3 4 1 2 1 1 2 1 1 2 4 2 0 4 1 3 2 3 2 3 3 0 2 1 2 1 2 2 2 1 2 1 1 2 1 1 2 1 1 2 1 0 1 1 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 1]
[0 0 0 0 0 0 0 0 0 1 0 0 0 1 1 1 0 1 0 0 1 1 0 1 1 1 1 0 0 0 1 1 1 0 1 0 1 0 0 0 0 0 0 0 0 1 1 0 1 1 1 1 0 1 1 1 1 2 1 1 0 0 1 1 0 1 1 1 0 1 1 1 0 1 0 1 1 1 1 1 1 0 0 1 0 0 1 0 1 1 0 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 0 0 0 0 1 0 1 0 0]
[0 1 1 1 1 1 0 0 1 2 1 1 2 2 1 1 2 1 2 0 2 2 2 2 3 3 3 0 0 1 3 3 4 1 3 1 5 2 0 2 3 2 3 1 3 2 4 2 4 2 3 4 1 4 4 3 4 5 1 2 2 1 3 1 2 2 5 3 1 5 1 4 3 3 2 4 3 1 4 1 2 1 3 3 2 1 2 1 2 3 1 2 2 2 2 3 1 1 2 1 2 1 1 1 0 1 1 1 1 0 1 0 1 0 1 0 0 0 0 0]
[0 1 1 1 1 1 0 0 1 2 1 1 2 2 1 1 1 1 2 0 2 2 1 2 3 3 3 0 0 1 2 2 3 1 2 1 4 2 0 2 2 2 2 0 2 2 3 1 3 2 3 3 0 3 3 3 3 4 1 1 1 0 2 1 1 1 4 2 1 3 1 3 2 2 1 3 2 1 3 1 2 1 2 2 1 1 1 0 2 2 0 2 1 1 1 2 1 1 1 1 1 0 0 0 0 1 1 1 0 0 1 0 0 1 1 0 0 1 1 0]
[0 1 1 1 1 2 1 1 1 2 2 2 2 3 1 1 1 2 3 0 2 2 2 3 3 4 4 1 1 2 3 3 4 1 2 1 5 3 1 2 3 2 3 1 2 3 5 2 4 2 4 4 0 4 3 3 3 5 2 2 1 0 3 2 1 1 5 2 1 4 1 4 3 3 2 4 3 1 3 1 3 2 2 2 1 2 2 1 2 3 1 2 2 1 1 2 1 1 1 1 1 0 0 0 1 1 0 1 0 0 0 0 1 1 0 0 0 1 1 0]
[0 1 1 1 1 1 0 0 1 2 1 1 1 2 1 1 1 1 1 0 2 2 1 2 2 2 2 0 0 0 2 2 2 0 2 0 3 1 0 1 1 1 1 0 1 1 2 1 2 1 2 2 0 2 2 2 2 3 1 1 1 0 2 1 1 1 2 2 1 2 1 2 1 1 0 2 1 1 2 1 1 0 1 1 0 0 1 0 1 1 0 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 1 0 1 1 1 0 1 0 0]
[0 1 1 1 1 2 1 1 1 2 2 2 1 3 1 1 1 2 2 0 2 2 2 3 2 3 3 1 1 1 3 3 3 0 2 0 4 2 1 1 2 1 2 1 1 2 4 2 3 1 3 3 0 3 2 2 2 4 2 2 1 0 3 2 1 1 3 2 1 3 1 3 2 2 1 3 2 1 2 1 2 1 1 1 0 1 2 1 1 2 1 1 1 1 1 1 0 0 0 0 0 0 0 0 1 1 0 0 0 0 1 1 1 1 0 1 0 1 0 0]
[0 1 1 1 1 1 0 0 1 1 1 1 1 1 0 0 1 0 1 0 1 1 1 1 1 1 1 0 0 0 1 1 1 0 1 0 2 1 0 1 1 1 1 0 1 0 1 1 1 0 1 1 0 1 1 1 1 1 0 0 1 0 1 0 1 0 1 1 1 1 0 1 1 0 0 1 0 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 1 1 0 0 0 0 0]
[1 2 2 1 1 3 2 2 1 3 2 2 3 4 2 2 2 3 4 0 2 2 3 3 4 5 5 1 1 3 4 4 6 2 3 2 6 3 1 2 4 2 4 2 3 4 6 2 5 3 4 5 1 5 4 3 4 6 2 3 1 1 3 2 1 2 6 2 0 5 1 4 3 4 3 4 4 1 3 1 3 2 2 3 2 2 2 1 2 3 1 2 2 1 1 2 1 1 1 1 1 0 0 0 0 0 0 0 1 0 0 0 1 1 0 0 1 1 1 1]
[1 2 2 1 1 3 2 2 1 3 2 2 2 4 2 2 2 3 3 0 2 2 3 3 3 4 4 1 1 2 4 4 5 1 3 1 5 2 1 1 3 1 3 2 2 3 5 2 4 2 3 4 1 4 3 2 3 5 2 3 1 1 3 2 1 2 4 2 0 4 1 3 2 3 2 3 3 1 2 1 2 1 1 2 1 1 2 1 1 2 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 1 0 1 1 1 0 1]
[0 1 1 1 1 2 1 1 1 1 2 2 1 2 0 0 1 1 2 0 1 1 2 2 1 2 2 1 1 1 2 2 2 0 1 0 3 2 1 1 2 1 2 1 1 1 3 2 2 0 2 2 0 2 1 1 1 2 1 1 1 0 2 1 1 0 2 1 1 2 0 2 2 1 1 2 1 0 1 0 1 1 1 0 0 1 1 1 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 1 1 1 1 1 0 0 0 0 0 0]
[1 2 2 1 1 3 2 2 1 2 2 2 2 3 1 1 2 2 3 0 1 1 3 2 2 3 3 1 1 2 3 3 4 1 2 1 4 2 1 1 3 1 3 2 2 2 4 2 3 1 2 3 1 3 2 1 2 3 1 2 1 1 2 1 1 1 3 1 0 3 0 2 2 2 2 2 2 0 1 0 1 1 1 1 1 1 1 1 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1 0 0 1 0 0 1]
[1 2 2 1 1 2 1 1 1 2 1 1 2 2 1 1 2 1 2 0 1 1 2 1 2 2 2 0 0 1 2 2 3 1 2 1 3 1 0 1 2 1 2 1 2 1 2 1 2 1 1 2 1 2 2 1 2 2 0 1 1 1 1 0 1 1 2 1 0 2 0 1 1 1 1 1 1 0 1 0 0 0 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 0 1 0 1 1 0 1 0 0 1]
[1 1 2 0 1 2 1 2 1 2 1 2 2 3 1 2 1 2 3 1 2 1 2 2 3 4 3 1 0 2 3 2 4 2 2 1 4 2 1 2 3 1 2 1 2 3 4 1 3 2 3 4 1 3 3 2 2 4 2 2 1 0 2 1 0 1 4 1 0 3 1 3 2 3 2 2 2 1 2 0 2 2 1 2 1 1 1 1 2 2 0 1 1 1 0 1 1 1 1 0 0 0 0 1 0 0 0 0 1 0 0 0 1 1 0 0 0 1 1 1]
[1 1 1 0 0 1 1 1 1 1 1 1 1 2 1 1 0 1 2 0 1 1 1 1 2 2 2 0 0 1 1 1 2 1 1 1 2 1 1 1 1 1 1 0 1 2 2 0 1 1 2 2 0 2 1 1 1 2 1 1 0 0 1 1 0 0 2 0 0 1 0 1 1 1 1 1 1 1 1 0 1 1 0 1 0 1 0 0 1 1 0 1 0 0 0 0 0 1 0 0 0 0 1 1 0 0 0 0 1 0 0 0 1 1 0 0 0 1 1 0]
[0 1 1 1 1 2 1 1 0 2 1 1 2 2 1 1 1 2 2 0 1 1 1 2 2 3 3 1 1 2 2 2 3 1 1 1 3 2 0 1 2 1 2 1 1 2 3 1 3 2 2 2 0 2 2 2 2 3 1 1 0 0 1 1 0 1 3 1 0 2 1 2 1 2 1 2 2 0 1 1 2 1 1 1 1 1 1 0 1 1 0 1 1 0 0 1 1 0 0 1 0 1 0 0 0 0 0 0 1 0 0 0 1 1 0 0 1 1 1 1]
[1 2 3 1 2 4 2 3 1 4 2 3 3 5 2 3 2 4 4 1 3 2 3 4 4 6 5 2 1 3 5 4 6 2 3 1 6 3 1 2 4 1 3 2 2 4 6 2 5 3 4 5 1 4 4 3 3 6 3 3 1 0 3 2 0 2 5 2 0 4 2 4 2 4 2 3 3 1 2 1 3 2 1 2 1 1 2 1 2 2 0 1 1 1 0 1 1 0 0 0 1 1 0 1 0 0 0 1 2 0 1 1 2 2 0 1 1 2 1 2]
[1 1 2 0 1 2 1 2 1 2 1 2 1 3 1 2 1 2 2 1 2 1 2 2 2 3 2 1 0 1 3 2 3 1 2 0 3 1 1 1 2 0 1 1 1 2 3 1 2 1 2 3 1 2 2 1 1 3 2 2 1 0 2 1 0 1 2 1 0 2 1 2 1 2 1 1 1 1 1 0 1 1 0 1 0 0 1 1 1 1 0 0 0 1 0 0 0 0 0 1 1 0 0 1 0 0 0 1 1 0 1 1 1 1 0 1 0 1 0 1]
[1 2 2 1 1 3 2 2 1 3 2 2 2 4 2 2 1 3 3 0 2 2 2 3 3 4 4 1 1 2 3 3 4 1 2 1 4 2 1 1 2 1 2 1 1 3 4 1 3 2 3 3 0 3 2 2 2 4 2 2 0 0 2 2 0 1 3 1 0 2 1 2 1 2 1 2 2 1 1 1 2 1 0 1 0 1 1 0 1 1 0 1 0 0 0 0 0 0 1 0 1 1 1 1 0 0 0 1 2 0 1 1 2 2 0 1 1 2 1 1]
[0 1 1 1 1 2 1 1 0 2 1 1 1 2 1 1 1 2 1 0 1 1 1 2 1 2 2 1 1 1 2 2 2 0 1 0 2 1 0 0 1 0 1 1 0 1 2 1 2 1 1 1 0 1 1 1 1 2 1 1 0 0 1 1 0 1 1 1 0 1 1 1 0 1 0 1 1 0 0 1 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 0 0 0 0 0 1 1 0 1 1 1 1 0 1 1 1 0 1]
[2 3 3 1 1 4 3 3 2 4 3 3 2 6 3 3 2 4 4 0 3 3 4 4 4 5 5 1 1 2 5 5 6 1 4 1 6 2 2 1 3 1 3 2 2 4 6 2 4 2 4 5 1 5 3 2 3 6 3 4 1 1 4 3 1 2 4 2 0 4 1 3 2 3 2 3 3 2 2 1 2 1 0 2 0 1 2 1 1 2 1 1 0 1 1 0 1 0 1 1 1 0 1 1 0 0 0 2 2 0 2 2 2 2 0 2 1 2 0 1]
[2 3 3 1 1 4 3 3 2 3 3 3 2 5 2 2 2 3 4 0 2 2 4 3 3 4 4 1 1 2 4 4 5 1 3 1 5 2 2 1 3 1 3 2 2 3 5 2 3 1 3 4 1 4 2 1 2 4 2 3 1 1 3 2 1 1 3 1 0 3 0 2 2 2 2 2 2 1 1 0 1 1 0 1 0 1 1 1 0 1 1 0 0 0 0 1 1 0 1 1 1 0 1 1 0 1 1 2 2 1 2 2 2 2 0 1 1 1 0 1]
[2 3 4 1 2 5 3 4 2 4 3 4 3 6 2 3 2 4 5 1 3 2 4 4 4 6 5 2 1 3 5 4 6 2 3 1 6 3 2 2 4 1 3 2 2 4 6 2 4 2 4 5 1 4 3 2 2 5 3 3 1 0 3 2 0 1 4 1 0 3 1 3 2 3 2 2 2 1 1 0 2 2 0 1 0 1 1 1 1 1 0 0 0 0 1 1 0 0 1 1 2 1 1 2 0 1 1 2 3 1 2 2 3 3 0 1 1 2 1 2]
[1 2 2 1 1 3 2 2 1 2 2 2 2 3 1 1 1 2 3 0 1 1 2 2 2 3 3 1 1 2 2 2 3 1 1 1 3 2 1 1 2 1 2 1 1 2 3 1 2 1 2 2 0 2 1 1 1 2 1 1 0 0 1 1 0 0 2 0 0 1 0 1 1 1 1 1 1 0 0 0 1 1 0 0 0 1 0 0 0 0 0 0 0 1 1 1 0 0 1 0 1 1 1 1 0 1 1 1 2 1 1 1 2 2 0 0 1 1 1 1]
[2 3 3 1 1 3 2 2 2 3 2 2 2 4 2 2 2 2 3 0 2 2 3 2 3 3 3 0 0 1 3 3 4 1 3 1 4 1 1 1 2 1 2 1 2 2 3 1 2 1 2 3 1 3 2 1 2 3 1 2 1 1 2 1 1 1 2 1 0 2 0 1 1 1 1 1 1 1 1 0 0 0 0 1 0 0 0 0 0 0 0 0 1 0 0 1 1 0 1 1 1 0 1 1 1 1 0 2 2 1 1 2 1 2 1 1 1 1 0 1]
[1 2 3 1 2 4 2 3 1 3 2 3 2 4 1 2 2 3 3 1 2 1 3 3 2 4 3 2 1 2 4 3 4 1 2 0 4 2 1 1 3 0 2 2 1 2 4 2 3 1 2 3 1 2 2 1 1 3 2 2 1 0 2 1 0 1 2 1 0 2 1 2 1 2 1 1 1 0 0 0 1 1 0 0 0 0 1 1 0 0 0 1 0 0 1 1 0 1 1 1 2 1 0 1 0 1 1 2 2 1 2 2 2 2 0 1 1 1 0 2]
[2 3 4 1 2 4 2 3 2 4 2 3 3 5 2 3 2 3 4 1 3 2 3 3 4 5 4 1 0 2 4 3 5 2 3 1 5 2 1 2 3 1 2 1 2 3 4 1 3 2 3 4 1 3 3 2 2 4 2 2 1 0 2 1 0 1 3 1 0 2 1 2 1 2 1 1 1 1 1 0 1 1 0 1 0 0 0 0 1 0 1 0 1 0 1 1 0 0 1 1 2 1 1 2 1 1 0 2 3 1 1 2 2 3 1 1 1 2 1 2]
[2 4 5 2 3 6 3 4 2 5 3 4 4 6 2 3 3 4 5 1 3 2 4 4 4 6 5 2 1 3 5 4 6 2 3 1 6 3 1 2 4 1 3 2 2 3 5 2 4 2 3 4 1 3 3 2 2 4 2 2 1 0 2 1 0 1 3 1 0 2 1 2 1 2 1 1 1 0 0 0 1 1 0 0 0 0 0 0 0 1 1 1 1 1 2 2 0 1 2 1 3 2 1 2 1 2 1 3 4 2 2 3 3 4 1 1 2 2 1 3]
[2 4 4 2 2 5 3 3 2 4 3 3 3 5 2 2 3 3 4 0 2 2 4 3 3 4 4 1 1 2 4 4 5 1 3 1 5 2 1 1 3 1 3 2 2 2 4 2 3 1 2 3 1 3 2 1 2 3 1 2 1 1 2 1 1 1 2 1 0 2 0 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 1 2 1 1 2 1 2 1 1 1 1 2 1 3 3 2 2 3 2 3 1 1 2 1 0 2]
[1 3 3 2 2 4 2 2 1 4 2 2 3 4 2 2 2 3 3 0 2 2 2 3 3 4 4 1 1 2 3 3 4 1 2 1 4 2 0 1 2 1 2 1 1 2 3 1 3 2 2 2 0 2 2 2 2 3 1 1 0 0 1 1 0 1 2 1 0 1 1 1 0 1 0 1 1 0 0 1 1 0 0 0 0 0 0 1 0 1 1 0 1 1 1 1 0 1 2 0 2 2 1 1 1 1 0 2 3 1 1 2 2 3 1 1 2 2 1 2]
[1 2 2 1 1 2 1 1 1 2 1 1 2 2 1 1 1 1 2 0 1 1 1 1 2 2 2 0 0 1 1 1 2 1 1 1 2 1 0 1 1 1 1 0 1 1 1 0 1 1 1 1 0 1 1 1 1 1 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 0 1 1 1 1 0 0 1 0 1 1 1 1 1 1 0 1 2 1 0 1 1 2 1 0 1 1 1 1]
[1 2 3 1 2 3 1 2 1 3 1 2 2 3 1 2 2 2 2 1 2 1 2 2 2 3 2 1 0 1 3 2 3 1 2 0 3 1 0 1 2 0 1 1 1 1 2 1 2 1 1 2 1 1 2 1 1 2 1 1 1 0 1 0 0 1 1 1 0 1 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 1 1 1 0 1 1 0 1 1 1 2 1 0 1 1 1 0 2 2 1 1 2 1 2 1 1 1 1 0 2]
[1 2 2 1 1 2 1 1 2 2 2 2 1 3 1 1 1 1 2 0 2 2 2 2 2 2 2 0 0 0 2 2 2 0 2 0 3 1 1 1 1 1 1 0 1 1 2 1 1 0 2 2 0 2 1 1 1 2 1 1 1 0 2 1 1 0 1 1 1 1 0 1 1 0 0 1 0 1 1 0 0 0 0 0 1 0 0 0 0 0 0 0 1 0 0 1 1 0 1 1 1 0 1 1 0 0 0 1 1 1 1 2 1 2 1 1 0 1 0 0]
[1 3 3 2 2 4 2 2 2 3 3 3 2 4 1 1 2 2 3 0 2 2 3 3 2 3 3 1 1 1 3 3 3 0 2 0 4 2 1 1 2 1 2 1 1 1 3 2 2 0 2 2 0 2 1 1 1 2 1 1 1 0 2 1 1 0 1 1 1 1 0 1 1 0 0 1 0 0 0 0 0 0 0 1 1 0 0 0 1 1 0 1 1 1 1 2 1 1 2 1 2 1 1 1 0 1 1 2 2 2 2 3 2 3 1 1 1 1 0 1]
[1 1 1 0 0 1 1 1 1 1 1 1 0 2 1 1 0 1 1 0 1 1 1 1 1 1 1 0 0 0 1 1 1 0 1 0 1 0 1 0 0 0 0 0 0 1 1 0 0 0 1 1 0 1 0 0 0 1 1 1 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 1 0 1 0 0 0 0 0 0 0 1 0 0 1 1 0 1 1 1 0 1 1 0 0 0 1 1 0 1 1 1 1 0 1 0 1 0 0]
[2 5 5 3 3 6 3 3 2 6 3 3 4 6 3 3 4 4 4 0 3 3 4 4 4 5 5 1 1 2 5 5 6 1 4 1 6 2 0 1 3 1 3 2 2 2 4 2 4 2 2 3 1 3 3 2 3 4 1 2 1 1 2 1 1 2 2 2 0 2 1 1 0 1 0 1 1 0 0 1 0 1 0 0 0 1 0 1 1 2 1 1 2 1 1 2 1 2 3 1 3 2 1 1 2 2 0 4 4 2 2 4 2 4 2 2 3 2 0 3]
[2 4 4 2 2 4 2 2 2 4 2 2 3 4 2 2 3 2 3 0 2 2 3 2 3 3 3 0 0 1 3 3 4 1 3 1 4 1 0 1 2 1 2 1 2 1 2 1 2 1 1 2 1 2 2 1 2 2 0 1 1 1 1 0 1 1 1 1 0 1 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 1 1 1 1 2 1 1 2 1 1 2 1 1 2 1 2 1 1 1 2 2 0 3 3 2 1 3 1 3 2 1 2 1 0 2]
[3 5 6 2 3 6 3 4 3 5 3 4 4 6 2 3 4 3 5 1 3 2 5 3 4 5 4 1 0 2 5 4 6 2 4 1 6 2 1 2 4 1 3 2 3 2 4 2 3 1 2 4 2 3 3 1 2 3 1 2 2 1 2 0 1 1 2 1 0 2 0 1 1 1 1 0 0 0 0 1 1 0 0 0 0 1 1 0 1 2 1 2 2 1 2 3 1 1 2 2 3 1 1 2 2 3 1 4 4 3 2 4 2 4 2 1 2 1 0 3]
[1 2 2 1 1 3 2 2 1 2 2 2 1 3 1 1 1 2 2 0 1 1 2 2 1 2 2 1 1 1 2 2 2 0 1 0 2 1 1 0 1 0 1 1 0 1 2 1 1 0 1 1 0 1 0 0 0 1 1 1 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 1 1 0 0 0 1 1 0 1 1 1 1 2 1 1 2 1 2 1 1 1 0 1 1 2 2 1 2 2 2 2 0 1 1 1 0 1]
[0 1 1 1 1 2 1 1 0 1 1 1 1 1 0 0 1 1 1 0 0 0 1 1 0 1 1 1 1 1 1 1 1 0 0 0 1 1 0 0 1 0 1 1 0 0 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 1 0 0 0 0 1 1 0 1 0 1 1 1 0 1 1 0 1 1 0 0 0 1 1 1 1 1 1 1 1 1 0 0 1 0 0 1]
[2 4 5 2 3 5 2 3 3 4 3 4 3 5 1 2 3 2 4 1 3 2 4 3 3 4 3 1 0 1 4 3 4 1 3 0 5 2 1 2 3 1 2 1 2 1 3 2 2 0 2 3 1 2 2 1 1 2 1 1 2 0 2 0 1 0 1 1 1 1 0 1 1 0 0 0 1 0 0 1 1 0 0 1 1 1 1 0 1 2 1 2 2 1 2 3 1 1 2 2 3 1 1 2 1 2 1 3 3 3 2 4 2 4 2 1 1 1 0 2]
[2 3 4 1 2 4 2 3 2 3 2 3 2 4 1 2 2 2 3 1 2 1 3 2 2 3 2 1 0 1 3 2 3 1 2 0 3 1 1 1 2 0 1 1 1 1 2 1 1 0 1 2 1 1 1 0 0 1 1 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 0 1 1 1 1 1 0 1 2 1 2 2 1 2 3 1 1 2 2 3 1 1 2 1 2 1 3 3 2 2 3 2 3 1 1 1 1 0 2]
[2 5 6 3 4 6 2 3 3 6 3 4 4 6 2 3 4 3 4 1 4 3 4 4 4 5 4 1 0 1 5 4 5 1 4 0 6 2 0 2 3 1 2 1 2 1 3 2 3 1 2 3 1 2 3 2 2 3 1 1 2 0 2 0 1 1 1 2 1 1 1 1 0 0 1 0 1 0 0 0 1 1 0 1 1 2 1 1 1 3 2 2 3 1 2 3 1 2 3 2 4 2 1 2 2 2 0 4 4 3 2 5 2 5 3 2 2 2 0 3]
[1 3 3 2 2 3 1 1 2 3 2 2 2 3 1 1 2 1 2 0 2 2 2 2 2 2 2 0 0 0 2 2 2 0 2 0 3 1 0 1 1 1 1 0 1 0 1 1 1 0 1 1 0 1 1 1 1 1 0 0 1 0 1 0 1 0 0 1 1 0 0 0 0 1 1 0 1 0 0 0 1 1 0 1 1 1 1 1 1 2 1 1 2 1 1 2 1 1 2 1 2 1 1 1 1 1 0 2 2 2 1 3 1 3 2 1 1 1 0 1]
[2 4 5 2 3 5 2 3 2 5 2 3 3 5 2 3 3 3 3 1 3 2 3 3 3 4 3 1 0 1 4 3 4 1 3 0 4 1 0 1 2 0 1 1 1 1 2 1 2 1 1 2 1 1 2 1 1 2 1 1 1 0 1 0 0 1 0 1 0 0 1 0 1 0 1 1 1 0 1 0 1 1 1 1 1 2 1 1 1 3 2 2 3 1 2 3 1 2 3 2 4 2 1 2 2 2 0 4 4 2 2 4 2 4 2 2 2 2 0 3]
[3 6 6 3 3 6 3 3 3 6 3 3 4 6 3 3 4 3 4 0 3 3 4 3 4 4 4 0 0 1 4 4 5 1 4 1 5 1 0 1 2 1 2 1 2 1 2 1 2 1 1 2 1 2 2 1 2 2 0 1 1 1 1 0 1 1 0 1 0 0 0 1 1 1 1 1 1 0 1 0 2 2 1 1 1 2 2 2 2 4 2 2 4 2 2 4 2 2 4 2 4 2 2 2 3 3 0 5 5 3 2 5 2 5 3 2 3 2 0 3]
[3 5 5 2 2 5 3 3 3 4 3 3 3 5 2 2 3 2 4 0 2 2 4 2 3 3 3 0 0 1 3 3 4 1 3 1 4 1 1 1 2 1 2 1 2 1 2 1 1 0 1 2 1 2 1 0 1 1 0 1 1 1 1 0 1 0 0 0 0 0 1 1 0 1 0 1 1 0 1 1 2 1 1 1 1 1 2 1 2 3 1 2 3 2 2 4 2 1 3 2 3 1 2 2 2 3 1 4 4 3 2 4 2 4 2 1 2 1 0 2]
[2 4 4 2 2 4 2 2 2 4 2 2 3 4 2 2 2 2 3 0 2 2 2 2 3 3 3 0 0 1 2 2 3 1 2 1 3 1 0 1 1 1 1 0 1 1 1 0 1 1 1 1 0 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 1 1 1 0 1 0 1 1 1 1 1 1 2 2 1 3 2 1 3 2 2 3 1 1 3 1 3 2 2 2 2 2 0 3 4 2 1 3 2 4 2 1 2 2 1 2]
[2 3 3 1 1 3 2 2 1 3 1 1 2 3 2 2 2 2 2 0 1 1 2 1 2 2 2 0 0 1 2 2 3 1 2 1 2 0 0 0 1 0 1 1 1 1 1 0 1 1 0 1 1 1 1 0 1 1 0 1 0 1 0 0 0 1 0 0 1 0 0 1 1 0 0 1 0 0 1 0 1 1 1 0 0 1 1 1 1 2 1 1 2 1 1 2 1 1 2 1 2 1 1 1 2 2 0 3 3 1 1 2 1 2 1 1 2 1 0 2]
[4 6 6 2 2 6 4 4 3 5 3 3 4 6 3 3 3 3 5 0 2 2 4 2 4 4 4 0 0 2 3 3 5 2 3 2 4 1 1 1 2 1 2 1 2 2 2 0 1 1 1 2 1 2 1 0 1 1 0 1 0 1 0 0 0 0 0 1 1 1 1 2 1 1 0 2 1 0 2 1 2 1 2 1 1 1 3 2 2 4 2 2 4 3 3 5 2 1 4 2 4 2 3 3 3 4 1 5 6 3 2 4 3 5 2 1 3 2 1 3]
[1 2 2 1 1 2 1 1 1 2 1 1 1 2 1 1 1 1 1 0 1 1 1 1 1 1 1 0 0 0 1 1 1 0 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 1 1 1 1 1 1 0 1 0 1 1 1 1 1 1 1 1 1 2 1 1 2 1 1 2 1 1 2 1 2 1 1 1 1 1 0 2 2 1 1 2 1 2 1 1 1 1 0 1]
[2 3 3 1 1 3 2 2 2 2 2 2 2 3 1 1 1 1 3 0 1 1 2 1 2 2 2 0 0 1 1 1 2 1 1 1 2 1 1 1 1 1 1 0 1 1 1 0 0 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 1 1 1 0 1 0 1 1 0 1 1 1 0 1 1 1 0 2 1 1 2 1 1 2 2 2 3 1 0 2 1 2 1 2 2 1 2 1 2 3 2 1 2 2 3 1 0 1 1 1 1]
[3 4 5 1 2 5 3 4 2 4 2 3 3 5 2 3 2 3 4 1 2 1 3 2 3 4 3 1 0 2 3 2 4 2 2 1 3 1 1 1 2 0 1 1 1 2 2 0 1 1 1 2 1 1 1 0 0 1 1 1 0 0 0 0 1 0 0 1 1 1 0 1 1 0 0 2 1 0 2 1 1 0 2 1 1 1 2 1 1 3 2 2 3 2 3 4 1 1 3 2 4 2 2 3 2 3 1 4 5 2 2 3 3 4 1 1 2 2 1 3]
[1 2 3 1 2 3 1 2 1 2 1 2 2 2 0 1 2 1 2 1 1 0 2 1 1 2 1 1 0 1 2 1 2 1 1 0 2 1 0 1 2 0 1 1 1 0 1 1 1 0 0 1 1 0 1 0 0 0 0 0 1 0 0 1 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 0 0 1 0 1 1 0 1 2 1 2 1 1 2 2 0 1 1 1 2 1 0 1 1 2 1 2 2 2 1 2 1 2 1 0 1 0 0 2]
[2 3 4 1 2 4 2 3 1 3 1 2 3 3 1 2 2 2 3 1 1 0 2 1 2 3 2 1 0 2 2 1 3 2 1 1 2 1 0 1 2 0 1 1 1 1 1 0 1 1 0 1 1 0 1 0 0 0 0 0 0 0 1 1 1 0 0 1 1 1 0 1 1 0 0 2 1 1 2 1 1 0 1 1 0 1 2 1 1 3 2 2 2 2 3 3 0 1 2 1 3 2 1 2 2 3 1 3 4 2 1 2 2 3 1 0 2 1 1 3]
[3 5 6 2 3 6 3 4 3 5 3 4 4 6 2 3 2 3 5 1 3 2 3 3 4 5 4 1 0 2 3 2 4 2 2 1 4 2 1 2 2 1 1 0 1 2 2 0 1 1 2 2 0 1 1 1 0 1 1 0 0 1 0 0 1 1 0 1 0 2 0 1 1 1 1 2 2 0 2 1 1 0 2 2 2 1 3 2 1 4 3 2 4 3 4 5 1 1 4 2 5 3 3 4 2 3 1 4 6 3 2 4 4 6 2 1 2 3 2 3]
[1 2 2 1 1 3 2 2 0 2 1 1 2 2 1 1 1 2 2 0 0 0 1 1 1 2 2 1 1 2 1 1 2 1 0 1 1 1 0 0 1 0 1 1 0 1 1 0 1 1 0 0 0 0 0 0 0 0 0 0 1 0 1 0 1 0 0 1 1 1 0 1 1 0 0 1 0 1 2 0 0 0 1 1 0 0 1 1 1 2 1 1 1 2 2 2 0 1 2 0 2 2 1 1 1 2 1 2 3 1 1 1 2 2 0 0 2 1 1 2]
[2 4 5 2 3 5 2 3 2 4 2 3 4 4 1 2 2 2 4 1 2 1 2 2 3 4 3 1 0 2 2 1 3 2 1 1 3 2 0 2 2 1 1 0 1 1 1 0 1 1 1 1 0 0 1 1 0 0 0 1 0 1 1 1 1 1 0 1 0 2 0 1 1 1 1 2 2 1 2 1 1 0 1 2 1 1 3 2 1 4 3 2 3 3 4 4 0 1 3 1 4 3 2 3 2 3 1 3 5 3 1 3 3 5 2 0 2 2 2 3]
[3 6 6 3 3 6 3 3 3 5 3 3 5 5 2 2 3 2 5 0 2 2 3 2 4 4 4 0 0 2 2 2 4 2 2 2 4 2 0 2 2 2 2 0 2 1 1 0 1 1 1 1 0 1 1 1 1 0 1 1 0 0 1 1 0 1 0 1 0 2 1 2 1 2 1 2 2 1 2 1 2 1 1 2 1 1 4 3 2 5 3 2 4 4 4 5 1 1 4 1 4 3 3 3 3 4 1 4 6 4 1 4 3 6 3 0 3 2 2 3]
[2 4 4 2 2 4 2 2 2 3 2 2 3 3 1 1 2 1 3 0 1 1 2 1 2 2 2 0 0 1 1 1 2 1 1 1 2 1 0 1 1 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 1 1 0 1 1 1 0 2 1 2 1 2 1 2 2 1 2 1 2 1 1 2 1 1 3 2 2 4 2 2 3 3 3 4 1 1 3 1 3 2 2 2 2 3 1 3 4 3 1 3 2 4 2 0 2 1 1 2]
[3 5 6 2 3 6 3 4 3 4 3 4 4 5 1 2 2 2 5 1 2 1 3 2 3 4 3 1 0 2 2 1 3 2 1 1 3 2 1 2 2 1 1 0 1 1 1 0 0 0 1 1 0 0 0 0 1 1 0 1 0 1 1 1 1 2 1 2 0 3 1 2 1 2 1 3 3 1 3 2 2 0 2 3 2 1 4 2 2 5 3 3 4 4 5 6 1 1 4 2 5 3 3 4 2 4 2 4 6 4 2 4 4 6 2 0 2 2 2 3]
[3 4 5 1 2 5 3 4 2 3 2 3 3 4 1 2 2 2 4 1 1 0 3 1 2 3 2 1 0 2 2 1 3 2 1 1 2 1 1 1 2 0 1 1 1 1 1 0 0 0 0 1 1 0 0 1 1 1 0 0 0 0 1 1 1 1 1 2 1 2 1 2 1 1 0 3 2 1 3 2 2 0 2 2 1 1 3 1 2 4 2 3 3 3 4 5 1 1 3 2 4 2 2 3 2 4 2 4 5 3 2 3 3 4 1 0 2 1 1 3]
[2 3 3 1 1 4 3 3 1 2 2 2 2 3 1 1 1 2 3 0 0 0 2 1 1 2 2 1 1 2 1 1 2 1 0 1 1 1 1 0 1 0 1 1 0 1 1 0 0 0 0 0 0 0 1 1 1 1 0 0 1 0 1 0 1 1 1 2 1 2 1 2 1 1 0 2 1 1 3 1 1 0 2 2 1 0 2 1 2 3 1 2 2 3 3 4 1 1 3 1 3 2 2 2 1 3 2 3 4 2 2 2 3 3 0 0 2 1 1 2]
[1 2 3 1 2 3 1 2 1 2 1 2 2 2 0 1 1 1 2 1 1 0 1 1 1 2 1 1 0 1 1 0 1 1 0 0 1 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 1 1 0 1 0 1 1 1 1 1 1 1 0 2 0 1 1 1 1 2 2 1 2 1 1 0 1 2 1 1 2 1 1 3 2 2 2 2 3 3 0 1 2 1 3 2 1 2 1 2 1 2 3 2 1 2 2 3 1 0 1 1 1 2]
[2 4 4 2 2 5 3 3 2 3 3 3 3 4 1 1 1 2 4 0 1 1 2 2 2 3 3 1 1 2 1 1 2 1 0 1 2 2 1 1 1 1 1 0 0 1 1 0 0 0 1 0 1 0 1 0 1 1 0 1 1 1 1 0 1 2 1 2 0 3 1 2 1 2 1 2 2 1 3 1 1 0 2 3 2 0 3 2 2 4 2 2 3 4 4 5 1 1 4 1 4 3 3 3 1 3 2 3 5 3 2 3 4 5 1 0 2 2 2 2]
[2 5 5 3 3 6 3 3 2 4 3 3 4 4 1 1 2 2 4 0 1 1 2 2 2 3 3 1 1 2 1 1 2 1 0 1 2 2 0 1 1 1 1 0 0 0 0 0 0 0 0 1 1 1 1 0 1 2 1 2 1 1 2 1 1 2 2 2 0 4 1 3 2 3 2 3 3 2 4 1 2 1 2 4 2 1 4 3 3 6 3 3 4 5 5 6 1 2 5 1 5 4 3 3 2 4 2 4 6 4 2 4 4 6 2 0 3 2 2 3]
[2 4 4 2 2 5 3 3 1 3 2 2 3 3 1 1 2 2 3 0 0 0 2 1 1 2 2 1 1 2 1 1 2 1 0 1 1 1 0 0 1 0 1 1 0 0 0 0 0 0 1 1 0 1 1 1 1 2 1 1 1 0 2 1 1 1 2 2 1 3 1 3 2 2 1 3 2 2 4 1 2 1 2 3 1 1 3 2 3 5 2 3 3 4 4 5 1 2 4 1 4 3 2 2 2 4 2 4 5 3 2 3 3 4 1 0 3 1 1 3]
[1 2 2 1 1 3 2 2 1 1 2 2 1 2 0 0 1 1 2 0 0 0 2 1 0 1 1 1 1 1 1 1 1 0 0 0 1 1 1 0 1 0 1 1 0 0 1 1 0 1 0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 1 1 1 0 1 1 1 0 1 0 1 1 1 2 1 1 0 1 2 1 0 1 0 2 2 0 2 1 2 2 3 1 1 2 1 2 1 1 1 0 2 2 2 2 2 2 2 2 2 0 0 1 0 0 1]
[1 1 1 0 0 1 1 1 1 0 1 1 0 1 0 0 0 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 1 1 1 0 1 1 1 0 1 0 1 1 0 1 1 1 0 1 1 1 0 1 0 1 1 0 1 1 1 1 2 1 0 1 1 1 0 1 1 0 1 1 1 1 1 1 1 1 1 0 0 0 0 0 0]
[2 2 2 0 0 2 2 2 1 1 1 1 1 2 1 1 0 1 2 0 0 0 1 0 1 1 1 0 0 1 0 0 1 1 0 1 0 0 1 0 0 0 0 0 0 1 0 1 1 0 0 0 0 0 1 1 1 1 0 0 1 0 1 0 1 1 1 2 1 2 1 2 1 1 0 2 1 0 2 1 1 0 2 1 1 0 2 1 1 2 1 1 2 2 2 3 1 0 2 1 2 1 2 2 1 2 1 2 3 1 1 1 2 2 0 0 1 1 1 1]
[2 3 3 1 1 3 2 2 1 2 1 1 2 2 1 1 1 1 2 0 0 0 1 0 1 1 1 0 0 1 0 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 1 1 1 0 1 1 0 1 1 1 1 2 1 1 1 0 2 1 1 1 2 2 1 3 1 3 2 2 1 3 2 1 3 1 2 1 2 2 1 1 3 2 2 4 2 2 3 3 3 4 1 1 3 1 3 2 2 2 2 3 1 3 4 2 1 2 2 3 1 0 2 1 1 2]
[1 2 2 1 1 2 1 1 1 1 1 1 1 1 0 0 1 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 1 0 1 1 1 1 2 1 1 0 0 1 1 0 1 2 1 0 2 1 2 1 2 1 2 2 1 2 1 2 1 1 2 1 1 2 1 2 3 1 2 2 2 2 3 1 1 2 1 2 1 1 1 1 2 1 2 2 2 1 2 1 2 1 0 1 0 0 1]
[1 3 3 2 2 4 2 2 1 3 2 2 2 3 1 1 1 2 2 0 1 1 1 2 1 2 2 1 1 1 1 1 1 0 0 0 1 1 0 0 0 0 0 0 1 0 0 0 0 0 0 1 1 1 1 0 1 1 0 1 1 1 1 0 1 1 2 1 0 3 0 2 2 2 2 2 2 1 3 0 1 1 2 3 2 1 2 2 2 4 2 2 3 3 3 4 1 2 4 1 4 3 2 2 1 2 1 3 4 2 2 3 3 4 1 1 2 2 1 2]
[2 4 4 2 2 4 2 2 2 3 2 2 3 3 1 1 1 1 3 0 1 1 1 1 2 2 2 0 0 1 0 0 1 1 0 1 1 1 0 1 0 1 0 1 0 0 1 1 1 0 0 1 1 1 1 0 1 2 1 2 1 1 2 1 1 2 2 2 0 4 1 3 2 3 2 3 3 1 3 1 2 1 2 3 2 1 4 3 2 5 3 2 4 4 4 5 1 1 4 1 4 3 3 3 2 3 1 3 5 3 1 3 3 5 2 0 2 2 2 2]
[2 4 5 2 3 5 2 3 2 4 2 3 3 4 1 2 1 2 3 1 2 1 1 2 2 3 2 1 0 1 1 0 1 1 0 0 1 1 0 1 0 0 1 1 1 0 1 1 1 0 0 1 1 2 1 0 2 2 0 2 1 2 2 1 2 2 3 2 0 5 0 3 3 3 3 4 4 1 4 1 2 1 3 4 3 2 4 3 2 6 4 3 5 4 5 6 1 2 5 2 6 4 3 4 2 3 1 4 6 3 2 4 4 6 2 1 2 3 2 3]
[2 3 4 1 2 4 2 3 1 3 1 2 2 3 1 2 1 2 2 1 1 0 1 1 1 2 1 1 0 1 1 0 1 1 0 0 0 0 0 0 0 1 1 0 1 0 1 1 1 0 1 1 0 2 1 1 2 2 0 1 1 1 2 1 2 1 3 2 1 4 0 3 3 2 2 4 3 1 4 1 2 1 3 3 2 2 3 2 2 5 3 3 4 3 4 5 1 2 4 2 5 3 2 3 2 3 1 4 5 2 2 3 3 4 1 1 2 2 1 3]
[1 2 2 1 1 2 1 1 1 2 1 1 1 2 1 1 0 1 1 0 1 1 0 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 1 1 0 1 1 2 1 0 3 0 2 2 2 2 2 2 0 2 0 1 1 2 2 2 1 2 2 1 3 2 1 3 2 2 3 1 1 3 1 3 2 2 2 1 1 0 2 3 1 1 2 2 3 1 1 1 2 1 1]
[2 4 4 2 2 5 3 3 1 4 2 2 2 4 2 2 1 3 2 0 1 1 1 2 1 2 2 1 1 1 1 1 1 0 0 0 0 0 0 1 1 1 1 0 2 0 1 1 1 0 1 2 1 2 2 1 2 2 0 1 2 1 2 0 2 1 4 2 1 5 0 4 4 3 3 4 3 1 5 0 2 2 4 4 3 2 3 3 3 6 3 3 5 4 4 6 2 3 6 2 6 4 3 3 2 3 1 5 6 2 3 4 4 5 1 2 3 3 1 3]
[0 1 1 1 1 1 0 0 0 1 0 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 1 1 0 0 0 1 1 0 1 0 0 0 1 1 1 0 0 1 1 0 0 1 0 0 1 0 1 1 1 1 1 1 1 1 0 1 1 0 1 0 1 1 1 1 2 1 1 1 1 1 1 0 1 1 0 1 1 0 0 1 1 0 1 1 1 0 1 0 1 1 0 1 0 0 1]
[2 3 3 1 1 3 2 2 1 3 1 1 1 3 2 2 1 2 1 0 1 1 1 1 1 1 1 0 0 0 1 1 1 0 1 0 0 1 0 1 1 1 1 0 1 0 1 1 1 0 1 1 0 1 1 1 1 1 0 0 1 0 1 0 1 0 3 1 1 3 0 3 3 2 2 3 2 0 3 0 2 2 3 2 2 2 2 2 2 4 2 2 4 2 2 4 2 2 4 2 4 2 2 2 2 2 0 4 4 1 2 3 2 3 1 2 2 2 0 2]
[1 1 1 0 0 1 1 1 0 1 0 0 0 1 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 1 0 1 0 1 1 1 0 1 1 0 1 1 1 1 1 0 0 1 0 1 0 1 0 2 1 1 2 0 2 2 1 1 2 1 0 2 0 1 1 2 1 1 1 1 1 1 2 1 1 2 1 1 2 1 1 2 1 2 1 1 1 1 1 0 2 2 0 1 1 1 1 0 1 1 1 0 1]
[1 2 3 1 2 3 1 2 1 2 1 2 1 2 0 1 1 1 1 1 1 0 1 1 0 1 0 1 0 0 1 0 0 0 0 1 0 0 0 0 0 1 1 0 1 1 1 0 1 1 1 1 0 2 1 1 2 2 0 1 0 1 1 1 1 1 3 1 0 3 0 2 2 2 2 3 3 1 3 1 2 1 2 3 2 2 2 1 2 4 2 3 3 2 3 4 1 2 3 2 4 2 1 2 1 2 1 3 3 2 2 3 2 3 1 1 1 1 0 2]
[1 2 2 1 1 3 2 2 0 2 1 1 1 2 1 1 0 2 1 0 0 0 0 1 0 1 1 1 1 1 0 0 0 0 1 0 1 0 0 1 1 1 1 0 2 0 1 1 1 0 1 2 1 2 2 1 2 2 0 1 2 1 2 0 2 1 3 2 1 4 0 3 3 2 2 3 2 1 4 0 1 1 3 3 2 1 2 2 2 4 2 2 3 3 3 4 1 2 4 1 4 3 2 2 1 2 1 3 4 1 2 2 3 3 0 1 2 2 1 2]
[1 3 3 2 2 4 2 2 1 3 2 2 1 3 1 1 1 2 1 0 1 1 1 2 0 1 1 1 1 0 1 1 0 1 0 1 0 0 0 1 1 1 1 0 2 1 1 0 1 1 1 2 1 2 2 1 2 2 0 1 1 1 1 0 1 1 4 1 0 4 0 3 3 3 3 3 3 1 4 0 2 2 3 4 3 2 2 2 3 5 2 3 4 3 3 5 2 3 5 2 5 3 2 2 1 2 1 4 4 2 3 4 3 4 1 2 2 2 0 2]
[1 3 3 2 2 4 2 2 1 3 2 2 1 3 1 1 0 2 1 0 1 1 0 2 0 1 1 1 1 0 0 0 1 1 1 1 1 0 0 1 2 1 2 1 3 1 2 1 2 1 1 3 2 3 3 1 3 3 0 2 2 2 2 0 2 2 5 2 0 6 0 4 4 4 4 4 4 1 5 0 2 2 4 5 4 2 3 3 3 6 3 3 5 4 4 6 2 3 6 2 6 4 3 3 1 2 1 4 5 2 3 4 4 5 1 2 2 3 1 2]
[1 2 3 1 2 3 1 2 1 2 1 2 1 2 0 1 0 1 1 1 1 0 0 1 0 1 0 1 0 0 0 1 1 0 1 1 1 0 0 0 1 1 2 1 2 1 2 1 2 1 1 2 1 3 2 1 3 3 0 2 1 2 2 1 2 2 4 2 0 5 0 3 3 3 3 4 4 1 4 1 2 1 3 4 3 2 3 2 2 5 3 3 4 3 4 5 1 2 4 2 5 3 2 3 1 2 1 3 4 2 2 3 3 4 1 1 1 2 1 2]
[1 2 2 1 1 2 1 1 1 1 1 1 1 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 1 0 1 0 0 0 1 0 1 1 1 1 2 1 2 1 1 2 1 2 2 1 2 3 1 2 1 1 2 1 1 2 3 2 0 4 1 3 2 3 2 3 3 1 3 1 2 1 2 3 2 1 3 2 2 4 2 2 3 3 3 4 1 1 3 1 3 2 2 2 1 2 1 2 3 2 1 2 2 3 1 0 1 1 1 1]
[1 2 2 1 1 2 1 1 1 2 1 1 0 2 1 1 0 1 0 0 1 1 0 1 0 0 0 0 0 1 0 0 1 1 0 1 1 1 0 1 2 1 2 1 2 1 2 1 2 1 1 2 1 2 2 1 2 2 0 1 1 1 1 0 1 1 4 1 0 4 0 3 3 3 3 3 3 0 3 0 2 2 3 3 3 2 2 2 2 4 2 2 4 2 2 4 2 2 4 2 4 2 2 2 1 1 0 3 3 1 2 3 2 3 1 2 1 2 0 1]
[2 3 4 1 2 3 1 2 2 3 1 2 1 3 1 2 0 1 1 1 2 1 0 1 1 1 0 0 1 1 0 1 1 0 0 1 1 1 0 0 2 1 3 2 2 1 3 2 3 1 1 2 1 3 2 1 3 3 0 2 1 2 2 1 2 2 5 2 0 6 0 4 4 4 4 5 5 0 4 1 3 2 4 4 4 3 4 3 2 6 4 3 6 3 4 6 2 2 5 3 6 3 3 4 2 2 0 4 5 2 2 4 3 5 2 2 1 3 1 2]
[2 3 3 1 1 2 1 1 2 2 1 1 1 2 1 1 0 0 1 0 1 1 0 0 1 0 0 1 1 1 1 1 1 0 0 0 1 1 0 0 2 0 2 2 1 1 3 2 3 1 1 2 1 2 2 1 2 3 1 2 1 1 2 1 1 2 4 2 0 5 1 4 3 4 3 4 4 0 3 1 3 2 3 3 3 2 4 3 2 5 3 2 5 3 3 5 2 1 4 2 4 2 3 3 2 2 0 3 4 2 1 3 2 4 2 1 1 2 1 1]
[1 1 2 0 1 1 0 1 1 1 0 1 0 1 0 1 0 0 0 1 1 0 0 0 0 0 1 0 1 1 0 1 1 0 0 1 1 1 0 0 1 1 2 1 1 1 2 1 2 1 1 1 0 2 1 1 2 2 0 1 0 1 1 1 1 1 3 1 0 3 0 2 2 2 2 3 3 0 2 1 2 1 2 2 2 2 2 1 1 3 2 2 3 1 2 3 1 1 2 2 3 1 1 2 1 1 0 2 2 1 1 2 1 2 1 1 0 1 0 1]
[2 3 3 1 1 2 1 1 2 2 1 1 0 2 1 1 0 0 0 0 1 1 0 0 0 1 1 1 1 2 1 1 2 1 0 1 2 2 0 1 3 1 3 2 2 2 4 2 4 2 2 3 1 3 3 2 3 4 1 2 1 1 2 1 1 2 6 2 0 6 1 5 4 5 4 5 5 0 4 1 4 3 4 4 4 3 4 3 3 6 3 3 6 3 3 6 3 2 5 3 5 2 3 3 2 2 0 4 4 2 2 4 2 4 2 2 1 2 0 1]
[1 2 2 1 1 2 1 1 1 1 1 1 0 1 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 1 1 1 2 1 1 1 2 1 0 1 2 1 2 1 2 2 3 1 3 2 2 3 1 3 3 2 3 4 1 2 1 1 2 1 1 2 5 2 0 5 1 4 3 4 3 4 4 1 4 1 3 2 3 4 3 2 3 2 3 5 2 3 4 3 3 5 2 2 4 2 4 2 2 2 1 2 1 3 3 2 2 3 2 3 1 1 1 1 0 1]
[2 2 2 0 0 1 1 1 1 1 0 0 0 1 1 1 0 0 0 0 0 0 0 1 0 1 1 1 1 1 1 1 1 0 0 0 2 2 0 1 2 1 2 1 1 1 3 2 3 1 2 2 0 2 2 2 2 3 1 1 1 0 2 1 1 1 4 2 1 4 1 4 3 3 2 4 3 0 3 1 3 2 3 2 2 2 3 2 2 4 2 2 4 2 2 4 2 1 3 2 3 1 2 2 2 2 0 3 3 1 1 2 1 2 1 1 1 1 0 1]
[0 1 1 1 1 1 0 0 0 1 0 0 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 1 1 1 0 1 0 1 0 1 0 1 0 1 1 1 1 2 1 1 0 1 2 1 2 1 0 1 2 1 2 1 1 2 1 1 1 2 1 0 3 0 2 2 2 2 2 2 1 2 0 1 1 1 2 1 1 2 2 1 3 2 1 2 2 2 2 0 1 2 0 2 2 1 1 1 1 0 1 2 1 0 1 1 2 1 0 1 1 1 1]
[2 2 3 0 1 2 1 2 1 1 0 1 0 1 0 1 0 0 0 1 0 1 0 1 1 1 2 0 1 1 1 2 2 0 1 1 3 2 0 1 2 2 3 1 2 2 4 2 4 2 3 3 0 4 3 3 4 5 1 2 1 1 3 2 2 2 6 3 1 6 1 5 4 4 3 6 5 1 5 2 4 2 4 4 3 3 4 2 3 6 3 4 5 3 4 6 2 2 4 3 5 2 2 3 2 3 1 4 4 2 2 3 2 3 1 1 1 1 0 2]
[1 1 1 0 0 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 1 0 0 0 1 1 1 0 1 0 2 1 0 1 1 1 1 0 1 1 2 1 2 1 2 2 0 2 2 2 2 3 1 1 1 0 2 1 1 1 3 2 1 3 1 3 2 2 1 3 2 1 3 1 2 1 2 2 1 1 2 1 2 3 1 2 2 2 2 3 1 1 2 1 2 1 1 1 1 2 1 2 2 1 1 1 1 1 0 0 1 0 0 1]
[2 3 2 1 0 2 2 1 1 1 1 0 0 1 1 0 0 0 0 1 1 0 0 1 1 2 1 1 0 1 2 1 2 1 1 0 3 2 0 2 3 1 2 1 2 2 4 2 4 2 3 4 1 3 4 3 3 5 2 2 2 0 3 1 1 2 6 3 1 6 2 6 4 5 3 5 4 1 5 1 4 3 4 4 3 2 4 3 4 6 2 3 5 4 3 6 3 2 5 2 4 2 3 2 2 3 1 4 4 2 2 3 2 3 1 1 2 1 0 1]
[0 1 1 1 1 1 0 0 0 1 0 0 0 0 0 0 0 0 1 0 0 0 1 0 1 1 1 0 0 1 1 1 2 1 1 1 2 1 1 1 2 1 2 1 2 2 3 1 2 1 2 3 1 3 2 1 2 3 1 2 1 1 2 1 1 1 4 1 0 4 0 3 3 3 3 3 3 1 3 0 2 2 2 3 2 2 2 2 2 4 2 2 3 2 2 3 1 2 3 1 3 2 1 1 1 1 0 2 2 1 1 2 1 2 1 1 1 1 0 1]
[1 1 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0 1 1 1 1 1 1 1 1 0 0 0 1 1 0 0 1 0 1 1 0 1 2 1 2 1 1 1 0 1 1 1 1 2 1 1 0 0 1 1 0 1 2 1 0 2 1 2 1 2 1 2 2 0 1 1 2 1 1 1 1 1 2 1 1 2 1 1 2 1 1 2 1 0 1 1 1 0 1 1 1 1 0 1 1 1 0 1 0 1 1 0 0 0 0 0]
[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 0 0 1 1 1 0 1 0 1 0 0 0 1 0 1 1 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 1 1 0 1 1 1 1 0 2 0 1 1 1 1 1 1 0 1 0 0 0 1 1 1 0 1 1 0 1 1 0 1 1 1 1 0 0 1 0 1 1 1 1 0 0 0 0 1 0 0 0 1 1 0 0 0 1 1 0]
[1 2 1 1 0 1 1 0 1 0 1 0 0 0 0 1 0 1 0 1 1 0 0 1 1 2 1 1 0 1 2 1 2 1 1 0 2 1 0 1 2 0 1 1 1 2 3 1 3 2 2 3 1 2 3 2 2 4 2 2 1 0 2 1 0 2 4 2 0 4 2 4 2 4 2 3 3 1 3 1 3 2 2 3 2 1 3 2 3 4 1 2 3 3 2 4 2 1 3 1 2 1 2 1 1 2 1 2 2 2 1 2 1 2 1 0 1 0 0 0]
[1 2 2 1 1 2 1 1 1 0 1 1 0 0 1 1 0 1 0 0 1 1 0 1 2 2 2 0 0 1 2 2 3 1 2 1 3 1 0 1 2 1 2 1 2 3 4 1 4 3 3 4 1 4 4 3 4 6 2 3 1 1 3 2 1 3 6 3 0 6 2 5 3 5 3 5 5 2 5 2 4 2 3 5 3 2 4 2 4 6 2 4 4 4 4 6 2 2 4 2 4 2 2 2 1 3 2 3 3 3 2 3 2 3 1 0 1 0 0 1]
[0 1 1 1 1 1 0 0 0 0 0 0 0 1 1 1 0 1 1 0 1 1 1 1 2 2 2 0 0 1 2 2 3 1 2 1 3 1 1 1 2 1 2 1 2 3 4 1 3 2 3 4 1 4 3 2 3 5 2 3 1 1 3 2 1 2 5 2 0 5 1 4 3 4 3 4 4 2 4 1 3 2 2 4 2 2 3 2 3 5 2 3 3 3 3 4 1 2 3 1 3 2 1 1 1 2 1 2 2 2 1 2 1 2 1 0 1 0 0 1]
[0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 1 0 0 0 1 0 1 1 1 0 0 1 1 1 2 1 1 1 2 1 0 1 2 1 2 1 2 1 2 1 2 1 1 2 1 2 2 1 2 2 0 1 1 1 1 0 1 1 3 1 0 3 0 2 2 2 2 2 2 0 2 0 1 1 2 2 2 1 1 1 1 2 1 1 2 1 1 2 1 1 2 1 2 1 1 1 0 0 0 1 1 0 1 1 1 1 0 1 0 1 0 0]
[1 2 1 1 0 1 1 0 0 0 0 1 0 1 0 1 0 1 1 1 2 1 1 2 2 3 2 1 0 1 3 2 3 1 2 0 4 2 1 2 3 1 2 1 2 3 5 2 4 2 4 5 1 4 4 3 3 6 3 3 2 0 4 2 1 2 6 3 1 6 2 6 4 5 3 5 4 2 5 1 4 3 3 4 2 2 4 3 4 6 2 3 4 4 3 5 2 2 4 1 3 2 2 1 2 3 1 3 3 2 1 2 1 2 1 0 2 0 0 1]
[1 1 1 0 0 0 0 0 0 0 1 1 0 1 0 0 0 1 1 0 1 1 1 2 1 2 2 1 1 1 2 2 2 0 1 0 3 2 1 1 2 1 2 1 1 2 4 2 3 1 3 3 0 3 2 2 2 4 2 2 1 0 3 2 1 1 4 2 1 4 1 4 3 3 2 4 3 1 3 1 3 2 2 2 1 2 3 2 2 4 2 2 3 2 2 3 1 1 2 1 2 1 1 1 2 2 0 2 2 1 0 1 0 1 1 0 1 0 0 1]
[0 0 0 0 0 0 0 0 0 1 0 0 1 1 1 1 1 1 1 0 1 1 1 1 2 2 2 0 0 1 2 2 3 1 2 1 3 1 0 1 2 1 2 1 2 2 3 1 3 2 2 3 1 3 3 2 3 4 1 2 1 1 2 1 1 2 4 2 0 4 1 3 2 3 2 3 3 1 3 1 2 1 2 3 2 1 2 1 2 3 1 2 2 2 2 3 1 1 2 1 2 1 1 1 0 1 1 1 1 1 1 1 1 1 0 0 0 0 0 0]
[0 0 0 0 0 0 0 0 1 0 1 1 0 1 0 0 0 0 1 0 1 1 1 1 1 1 1 0 0 0 1 1 1 0 1 0 2 1 1 1 1 1 1 0 1 1 2 1 1 0 2 2 0 2 1 1 1 2 1 1 1 0 2 1 1 0 2 1 1 2 0 2 2 1 1 2 1 1 2 0 1 1 1 1 0 1 1 1 1 2 1 1 1 1 1 1 0 1 1 0 1 1 0 0 1 1 0 1 1 0 0 0 0 0 0 0 1 0 0 1]
[0 1 0 1 0 0 0 1 0 0 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 2 1 1 0 1 2 1 2 1 1 0 2 1 1 1 2 0 1 1 1 2 3 1 2 1 2 3 1 2 2 1 1 3 2 2 1 0 2 1 0 1 3 1 0 3 1 3 2 3 2 2 2 1 2 0 2 2 1 2 1 1 2 2 2 3 1 1 2 2 1 2 1 1 2 0 1 1 1 0 1 1 0 1 1 1 0 1 0 1 1 0 1 0 0 0]
[0 1 1 1 1 0 1 1 0 0 1 1 0 2 1 1 0 2 2 0 1 1 2 2 2 3 3 1 1 2 3 3 4 1 2 1 4 2 2 1 3 1 3 2 2 4 6 2 4 2 4 5 1 5 3 2 3 6 3 4 1 1 4 3 1 2 6 2 0 6 1 5 4 5 4 5 5 2 4 1 4 3 2 4 2 3 4 3 3 6 3 3 4 3 3 4 1 2 3 1 3 2 1 1 2 2 0 2 2 2 0 2 0 2 2 0 1 0 0 1]
[0 0 0 0 0 1 1 1 0 1 1 1 1 2 1 1 1 2 2 0 1 1 2 2 2 3 3 1 1 2 3 3 4 1 2 1 4 2 1 1 3 1 3 2 2 3 5 2 4 2 3 4 1 4 3 2 3 5 2 3 1 1 3 2 1 2 5 2 0 5 1 4 3 4 3 4 4 1 3 1 3 2 2 3 2 2 3 2 2 4 2 2 3 2 2 3 1 1 2 1 2 1 1 1 1 1 0 1 1 1 0 1 0 1 1 0 0 0 0 0]
[1 1 0 0 1 1 0 1 0 1 1 2 1 2 0 1 1 2 2 1 2 1 2 3 2 4 3 2 1 2 4 3 4 1 2 0 5 3 1 2 4 1 3 2 2 3 6 3 5 2 4 5 1 4 4 3 3 6 3 3 2 0 4 2 1 2 6 3 1 6 2 6 4 5 3 5 4 1 4 1 4 3 3 3 2 2 4 3 3 5 2 2 4 3 2 4 2 1 3 1 2 1 2 1 2 2 0 2 2 1 0 1 0 1 1 0 1 0 0 0]
[1 0 0 1 1 1 0 0 0 1 1 1 1 1 0 0 1 1 1 0 1 1 1 2 1 2 2 1 1 1 2 2 2 0 1 0 3 2 0 1 2 1 2 1 1 1 3 2 3 1 2 2 0 2 2 2 2 3 1 1 1 0 2 1 1 1 3 2 1 3 1 3 2 2 1 3 2 0 2 1 2 1 2 1 1 1 2 1 1 2 1 1 2 1 1 2 1 0 1 1 1 0 1 1 1 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0]
[0 0 1 0 1 1 0 1 1 1 1 2 1 2 0 1 1 1 2 1 2 1 2 2 2 3 2 1 0 1 3 2 3 1 2 0 4 2 1 2 3 1 2 1 2 2 4 2 3 1 3 4 1 3 3 2 2 4 2 2 2 0 3 1 1 1 4 2 1 4 1 4 3 3 2 3 2 1 3 0 2 2 2 2 1 1 2 2 2 3 1 1 2 2 1 2 1 1 2 0 1 1 1 0 1 1 0 1 1 0 0 0 0 0 0 0 1 0 0 0]
[0 1 1 1 1 2 1 1 1 2 2 2 2 3 1 1 2 2 3 0 2 2 3 3 3 4 4 1 1 2 4 4 5 1 3 1 6 3 1 2 4 2 4 2 3 3 6 3 5 2 4 5 1 5 4 3 4 6 2 3 2 1 4 2 2 2 6 3 1 6 1 5 4 4 3 5 4 1 4 1 3 2 3 3 2 2 3 2 2 4 2 2 3 2 2 3 1 1 2 1 2 1 1 1 1 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0]
#+end_example




